Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: / / get author info and generate DocBook entry $auth = "24\tLewis Carroll"; $n = sscanf($auth ,"%d\t%s %s", $id, $first, $last); echo" author id='$id 'firstname $first / firstname surname $last / surname / author \n";
es: / / obtener autor y generar la ficha DocBook $autor = "24\tLewis Carroll"; $n = sscanf($autor ,"%d\t%s %s", $id, $nombre, $apell); echo" autor id='$id 'firstname $nombre / firstname surname $apell / surname / author \n";

source: See also fscanf(), printf(), and sprintf().
es: Vea también: fscanf(), printf(), y sprintf().

source: Gathers the statistics of the file named by filename.
es: Recoje los datos sobre el fichero indicado por filename.

source: device
es: dispositivo (device)

source: inode protection mode
es: modo de protección del inode

source: device type if inode device *
es: id de grupo del propietario

source: Returns FALSE in case of error.
es: tamaño del bloque para el sistema I / O *

source: stat() cannot be used on remote files.
es: número de bloques ocupados

source: Returns 0 if str1 is less than str2; 0 if str1 is greater than str2, and 0 if they are equal.
es: Devuelve 0 si cad1 es menor que cad2; 0 si cad1 es mayor que cad2, y 0 si son iguales.

source: Example 1. strcasecmp() example
es: Ejemplo de strcasecmp()

source: $var1 = "Hello"; $var2 = "hello"; if (!strcasecmp($var1, $var2)) {echo '$var1 is equal to $var2 in a case-insensitive string comparison';}
es: $var1 = "Hello"; $var2 = "hello"; if (!strcasecmp ($var1, $var2)) {echo '$var1 es igual a $var2 en una comparación sin tener en cuenta '.'mayúsculas o minúsculas';}

source: See also ereg(), strcmp(), substr(), stristr(), strncasecmp(), and strstr().
es: Vea también ereg(), strcmp(), substr(), stristr(), y strstr().

source: This function is an alias for strstr(), and is identical in every way.
es: Esta función es un alias para strstr(), y es idéntica en todo.

source: Note that this comparison is case sensitive.
es: Nótese que esta comparación es sensible a mayúsculas y minúsculas.

source: See also ereg(), strcasecmp(), substr(), stristr(), strncasecmp(), strncmp(), and strstr().
es: Vea también ereg(), strcasecmp(), substr(), stristr(), strncmp(), y strstr().

source: Returns the length of the initial segment of str1 which does not contain any of the characters in str2.
es: Devuelve la longitud del segmento inicial de cad1 que no contiene ninguno de los caracteres de cad2.

source: See also strspn().
es: Vea también strspn().

source: See Appendix I for more information about wrappers.
es: See Apéndice I for more information about wrappers.

source: See Appendix I for more information about wrappers and their wrapper data.
es: See Apéndice I for more information about wrappers and their wrapper data.

source: Example 1. stream_set_timeout() Example
es: Ejemplo 1. stream_set_timeout() Example

source: Example 1. stream_set_write_buffer() example
es: Ejemplo 1. stream_set_write_buffer() example

source: Month and weekday names and other language dependent strings respect the current locale set with setlocale().
es: Devuelve una cadena formateada según la cadena de formato dada utilizando el valor timestamp o la hora local actual.

source: %a - abbreviated weekday name according to the current locale
es: Los nombres del mes y el día de la semana y otras cadenas dependientes del idioma respetan lo establecido con setlocale().

source: %b - abbreviated month name according to the current locale
es: Se reconocen los siguientes especificadores de conversión en la cadena de formato:

source: %c - preferred date and time representation for the current locale
es: %a - nombre del día de la semana abreviado

source: %d - day of the month as a decimal number (range 01 to 31)
es: %A - nombre del día de la semana completo

source: %e - day of the month as a decimal number, a single digit is preceded by a space (range '1' to '31')
es: %b - nombre del mes abreviado

source: %G - The 4-digit year corresponding to the ISO week number (see %V).
es: %B - nombre del mes completo

source: %h - same as %b
es: %c - representación de fecha y hora preferidas en el idioma actual

source: %I - hour as a decimal number using a 12-hour clock (range 01 to 12)
es: %d - día del mes en número (de 00 a 31)

source: %m - month as a decimal number (range 01 to 12)
es: %H - hora como un número de 00 a 23

source: %n - newline character
es: %I - hora como un número de 01 a 12

source: %r - time in a.m. and p.m. notation
es: %j - día del año como un número de 001 a 366

source: %S - second as a decimal number
es: %m - mes como un número de 01 a 12

source: %u - weekday as a decimal number [1,7], with 1 representing Monday
es: %M - minuto en número

source: Sun Solaris seems to start with Sunday as 1 although ISO 9889:1999 (the current C standard) clearly specifies that it should be Monday.
es: %p - `am' o `pm ', según la hora dada, o las cadenas correspondientes en el idioma actual

source: %V - The ISO 8601:1988 week number of the current year as a decimal number, range 01 to 53, where week 1 is the first week that has at least 4 days in the current year, and with Monday as the first day of the week. (Use %G or %g for the year component that corresponds to the week number for the specified timestamp.)
es: %S - segundos en número

source: %w - day of the week as a decimal, Sunday being 0
es: %U - número de la semana en el año, empezando con el primer domingo como el primer día de la primera semana

source: %X - preferred time representation for the current locale without the date
es: %W - número de la semana en el año, empezando con el primer lunes como el primer día de la primera semana

source: %Y - year as a decimal number including the century
es: %w - día de la semana en número (el domingo es el 0)

source: %% - a literal `% 'character
es: %x - representación preferida de la fecha sin la hora

source: Not all conversion specifiers may be supported by your C library, in which case they will not be supported by PHP' s strftime().
es: %X - representación preferida de la hora sin la fecha

source: Example 1. strftime() locale examples
es: %y - año en número de 00 a 99

source: Note: %G and %V, which are based on ISO 8601:1988 week numbers can give unexpected (albiet correct) results if the numbering system is not thoroughly understood.
es: %Y - año en número de cuatro cifras

source: ISO 8601:1988 week number example
es: %Z - nombre o abreviatura de la zona horaria

source: 12 / 28 / 2002 - %V,%G,%Y = 52,2002,2002 print "12 / 28 / 2002 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("12 / 28 / 2002")). "\n"; / / Outputs:
es: %% - carácter `% '

source: 1 / 3/2003 - %V,%G,%Y = 1,2003,2003 print "1 / 3/2003 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("1 / 3/2003")). "\n"; / / Outputs:
es: Ejemplo 1.

source: 12 / 23 / 2004 - %V,%G,%Y = 52,2004,2004 print "12 / 23 / 2004 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("12 / 23 / 2004")). "\n"; / / Outputs:
es: Ejemplo de strftime()

source: 1 / 2/2005 - %V,%G,%Y = 53,2004,2005 print "1 / 2/2005 - %V,%G,%Y =". strftime("%V,%G,%Y",strtotime("1 / 2/2005")). "\n"; / / Outputs:
es: setlocale ("LC_TIME", "C"); print(strftime("%A in Finnish is ")); setlocale ("LC_TIME", "fi_FI"); print(strftime("%A, in French ")); setlocale ("LC_TIME", "fr_CA"); print(strftime("%A and in German ")); setlocale ("LC_TIME", "de_DE"); print(strftime("%A.\n"));

source: See also setlocale() and mktime() and the Open Group specification of strftime().
es: Ver también setlocale() y mktime().

source: Returns a string with backslashes stripped off.
es: Devuelve una cadena con las barras invertidas eliminadas.

# Recognizes C-like , ..., octal and hexadecimal representation.
source: Recognizes C-like \n, \r..., octal and hexadecimal representation.
es: Nota:

source: See also addcslashes().
es: Vea también addcslashes().

source: Returns a string with backslashes stripped off. (\ 'becomes' and so on.) Double backslashes are made into a single backslash.
es: Las barras invertidas dobles se convierten en sencillas.

source: See also addslashes().
es: Vea también addslashes().

source: It errors on the side of caution in case of incomplete or bogus tags.
es: Esta función intenta eliminar todas las etiquetas HTML y PHP de la cadena dada.

source: You can use the optional second parameter to specify tags which should not be stripped.
es: Causa error por precaución en caso de etiquetas incompletas o falsas.

source: $string = strip_tags( $string, 'a b i u ');
es: Utiliza la misma máquina de estados para eliminar las etiquetas que la función fgetss().

source: This function does not modify any attributes on the tags that you allow using allowable_tags, including the style and onmouseover attributes that a mischievous user may abuse when posting text that will be shown to other users.
es: Puede usar el parámetro opcional para especificar las etiquetas que no deben eliminarse.

source: Returns all of haystack from the first occurrence of needle to the end. needle and haystack are examined in a case-insensitive manner.
es: Devuelve todo el pajar desde la primera aparición de la aguja, siendo el pajar examinado sin tener en cuenta mayúsculas o minúsculas.

source: If needle is not found, returns FALSE.
es: Si la aguja no se encuentra, devuelve FALSE.

source: If needle is not a string, it is converted to an integer and applied as the ordinal value of a character.
es: Si la aguja no es una cadena, es convertida a entero y usada como código de un carácter ASCII.

source: See also strchr(), strrchr(), substr(), and ereg().
es: Vea también strchr(), strrchr(), substr(), y ereg().

source: Returns the length of string.
es: Devuelve la longitud de la cadena.

source: This function implements a comparison algorithm that orders alphanumeric strings in the way a human being would.
es: Esta función implementa un algoritmo de comparación que ordena las cadenas alfanuméricas como lo haría un ser humano.

source: The behaviour of this function is similar to strnatcmp(), except that the comparison is not case sensitive.
es: El comportamiento de esta función es similar a strnatcmp(), pero la comparación no es sensible a mayúsculas y minúsculas.

source: Martin Pool 's Natural Order String Comparison page.
es: Para más información, vea la página de Martin Pool sobre Comparación de Cadenas en Orden Natural.

source: Similar to other string comparison functions, this one returns 0 if str1 is less than str2; 0 if str1 is greater than str2, and 0 if they are equal.
es: De forma similar a otras funciones de comparación de cadenas, esta devuelve 0 si cad1 es menor que cad2; 0 si cad1 es mayor que cad2, y 0 si son iguales.

source: See also ereg(), strcasecmp(), substr(), stristr(), strcmp(), strncmp(), strncasecmp(), strnatcmp(), and strstr().
es: Vea también ereg(), strcasecmp(), substr(), stristr(), strcmp(), strncmp(), strnatcmp(), y strstr().

source: This function implements a comparison algorithm that orders alphanumeric strings in the way a human being would, this is described as a "natural ordering".
es: Esta función implementa un algoritmo de comparación que ordena las cadenas alfanuméricas como lo haría un ser humano, que es lo que se denomina "orden natural".

source: An example of the difference between this algorithm and the regular computer string sorting algorithms (used in strcmp()) can be seen below:
es: A continuación se puede ver un ejemplo de la diferencia entre este algoritmo y los algoritmos de ordenación de cadenas habituales en los ordenadores (utilizados en strcmp()):

source: $arr1 = $arr2 = array( "img12.png" ,"img10.png" ,"img2.png" ,"img1.png"); echo "Standard string comparison\n"; usort($arr1 ,"strcmp"); print_r($arr1); echo "\nNatural order string comparison\n"; usort($arr2 ,"strnatcmp"); print_r($arr2);
es: $matriz1 = $matriz2 = array ("img12.png" ,"img10.png" ,"img2.png" ,"img1.png"); echo "Comparación de cadenas estándar\n"; usort($matriz1 ,"strcmp"); print_r($matriz1); echo "\nComparación de cadenas en orden natural\n"; usort($matriz2 ,"strnatcmp"); print_r($matriz2);

source: Standard string comparison Array ([0] = img1.png [1] = img10.png [2] = img12.png [3] = img2.png) Natural order string comparison Array ([0] = img1.png [1] = img2.png [2] = img10.png [3] = img12.png)
es: Comparación de cadenas estándar Array ([0] = img1.png [1] = img10.png [2] = img12.png [3] = img2.png) Comparación de cadenas en orden natural Array ([0] = img1.png [1] = img2.png [2] = img10.png [3] = img12.png)

source: See also ereg(), strcasecmp(), substr(), stristr(), strcmp(), strncmp(), strncasecmp(), strnatcasecmp(), strstr(), natsort() and natcasesort().
es: Vea también ereg(), strcasecmp(), substr(), stristr(), strcmp(), strncmp(), strnatcasecmp(), y strstr().

source: This function is similar to strcmp(), with the difference that you can specify the (upper limit of the) number of characters (len) from each string to be used in the comparison.
es: Esta función es similar a strcmp(), con la diferencia que se puede especificar el (límite superior del) número de caractares (largo) de cada cadena que se usarán en la comparación.

source: If any of the strings is shorter than len, then the length of that string will be used for the comparison.
es: Si alguna de las cadenas es menor que el largo, se usará su longitud para la comparación.

source: See also ereg(), strncasecmp(), strcasecmp(), substr(), stristr(), strcmp(), and strstr().
es: Vea también ereg(), strcasecmp(), substr(), stristr(), strcmp(), y strstr().

source: This functions returns the input string padded on the left, the right, or both sides to the specified padding length.
es: Esta función rellena la cadena entrada por la derecha, la izquierda o por ambos lados hasta el largo indicado.

source: If the optional argument pad_string is not supplied, the input is padded with spaces, otherwise it is padded with characters from pad_string up to the limit.
es: En caso contrario, será rellenada con los caracteres de cad_relleno hasta el límite.

source: Optional argument pad_type can be STR_PAD_RIGHT, STR_PAD_LEFT, or STR_PAD_BOTH.
es: El argumento opcional tipo_relleno puede valer STR_PAD_RIGHT, STR_PAD_LEFT, o STR_PAD_BOTH.

source: If pad_type is not specified it is assumed to be STR_PAD_RIGHT.
es: Si no se especifica, se asume que vale STR_PAD_RIGHT.

source: If the value of pad_length is negative or less than the length of the input string, no padding takes place.
es: Si el valor de tama_relleno es negativo o menor que la longitud de la cadena de entrada, no se produce rellenado alguno.

source: Example 1. str_pad() example
es: Ejemplo de str_pad()

source: $input = "Alien"; print str_pad($input, 10); / / produces "Alien" print str_pad($input, 10, "-=", STR_PAD_LEFT); / / produces "-=-=-Alien "print str_pad($input, 10, "_", STR_PAD_BOTH); / / produces "__Alien___"
es: $entrada = "Alien"; print str_pad($entrada, 10); / / produce "Alien" print str_pad($entrada, 10, "-=", STR_PAD_LEFT); / / produce "-=-=-Alien "print str_pad($entrada, 10, "_", STR_PAD_BOTH); / / produce "__Alien___"

source: Returns the numeric position of the first occurrence of needle in the haystack string.
es: Devuelve la posición numérica de la primera aparición de la aguja en la cadena pajar.

source: Unlike the strrpos(), this function can take a full string as the needle parameter and the entire string will be used.
es: A diferencia de strrpos(), esta función puede tomar una cadena completa como aguja y se utilizará en su totalidad.

source: It is easy to mistake the return values for "character found at position 0" and "character not found ".
es: Es fácil confundir los valores de retorno para "caracter encontrado en la posición 0" y "caracter no encontrado ".

source: Here 's how to detect the difference:
es: Aquí se indica cómo detectar la diferencia:

source: / / in PHP 4.0b3 and newer: $pos = strpos( $mystring, "b"); if ($pos === false) {/ / note: three equal signs / / not found...} / / in versions older than 4.0b3: $pos = strpos($mystring, "b"); if (!is_integer($pos)) {/ / not found...}
es: / / en PHP 4.0b3 y posteriores: $pos = strpos ($micadena, "b"); if ($pos === false) {/ / nota: tres signos igual / / no encontrado...} / / en versiones anteriores a la 4.0b3: $pos = strpos ($micadena, "b"); if (is_string ($pos) !$pos) {/ / no encontrado...}

source: The optional offset parameter allows you to specify which character in haystack to start searching.
es: El parámetro opcional desplazamiento le permite especificar a partir de qué caracter del pajar El parámetro opcional desplazamiento le permite especificar a partir de qué caracter del pajar comenzar a buscar.

source: The position returned is still relative to the the beginning of haystack.
es: La posición devuelta es aún relativa al comienzo de pajar.

source: See also strrpos(), strrchr(), substr(), stristr(), and strstr().
es: Vea también strrpos(), strrchr(), substr(), stristr(), y strstr().

source: This function returns the portion of haystack which starts at the last occurrence of needle and goes until the end of haystack.
es: Esta función devuelve la porción del pajar que comienza en la última aparición de la aguja y continúa hasta el final del pajar.

source: Returns FALSE if needle is not found.
es: Devuelve FALSE si la aguja no es hallada.

source: If needle contains more than one character, the first is used.
es: Si la aguja contiene más de un caracter, sólo se usará el primero.

source: Example 1. strrchr() example
es: Ejemplo de strrchr()

source: / / get last directory in $PATH $dir = substr( strrchr($PATH, ":"), 1); / / get everything after last newline $text = "Line 1\nLine 2\nLine 3"; $last = substr(strrchr($text, 10), 1);
es: / / obtener el último directorio de $PATH $dir = substr (strrchr ($PATH, ":"), 1); / / obtener todo tras el último salto de línea $texto = "Line 1\nLine 2\nLine 3"; $apell = substr (strrchr ($texto, 10), 1);

source: See also strchr(), substr(), stristr(), and strstr().
es: Vea también substr(), stristr(), y strstr().

source: If the multiplier is set to 0, the function will return an empty string.
es: Devuelve la cad_entrada repetida veces. veces debe ser mayor que 0.

source: Example 1. str_repeat() example
es: Ejemplo de str_repeat()

source: This will output "-=-=-=-=-=-=-=-=-=-=".
es: Esto mostrará "-=-=-=-=-=-=-=-=-=-=".

source: See also for, str_pad(), and substr_count().
es: Esta función fue añadida en el PHP 4.0.

source: If you don' t need fancy replacing rules, you should always use this function instead of ereg_replace() or preg_replace().
es: Esta función sustituye todas las apariciones de la aguja en el pajar por la cad dada.

source: If subject is an array, then the search and replace is performed with every entry of subject, and the return value is an array as well.
es: Si no precisa reglas especiales de sustitución, deberá usar siempre esta función en lugar de ereg_replace().

source: If search and replace are arrays, then str_replace() takes a value from each array and uses them to do search and replace on subject.
es: Ejemplo 1.

source: If replace has fewer values than search, then an empty string is used for the rest of replacement values.
es: Ejemplo de str_replace()

source: Example 1. str_replace() example
es: $bodytag = str_replace ("%cuerpo%", "negro", "body text=%cuerpo% ");

source: $bodytag = str_replace( "%body%", "black", "body text=%body% ");
es: Esta función tiene seguridad binaria.

source: See also ereg_replace(), preg_replace(), and strtr().
es: Vea también ereg_replace() y strtr().

source: php echo strrev( "Hello world !"); / / outputs "!dlrow olleH "?
es: Devuele la cadena invertida.

source: Note that the needle in this case can only be a single character.
es: Devuele la posición numérica de la última aparición de la aguja en el pajar.

source: / / in PHP 4.0b3 and newer: $pos = strrpos( $mystring, "b"); if ($pos === false) {/ / note: three equal signs / / not found...} / / in versions older than 4.0b3: $pos = strrpos($mystring, "b"); if (is_string($pos) !$pos) {/ / not found...}
es: Si la aguja no es una cadena, se convierte a entero y se aplica como el valor ordinal de un caracter.

source: See also strpos(), strrchr(), substr(), stristr(), and strstr().
es: Vea también strpos(), strrchr(), substr(), stristr(), y strstr().

source: Example 1. str_shuffle() example
es: Ejemplo 1. str_shuffle() example

source: Returns the length of the initial segment of str1 which consists entirely of characters in str2.
es: Devuelve la longitud del segmento inicial de cad1 que consiste por entero en caracteres contenidos en cad2.

source: The line of code:
es: devolverá 2 como resultado.

source: See also strcspn().
es: Vea también strcspn().

source: Returns part of haystack string from the first occurrence of needle to the end of haystack.
es: Devuelve todo el pajar desde la primera aparición de la aguja hasta el final.

source: This function is case-sensitive.
es: Nota:

source: Example 1. strstr() example
es: Nótese que esta función es sensible a mayúsculas y minúsculas.

source: $email = 'user@example.com'; $domain = strstr($email, '@'); print $domain; / / prints @example.com
es: Ejemplo 1.

source: If you only want to determine if a particular needle occurs within haystack, use the faster and less memory intensive function strpos() instead.
es: $email = 'sterling@designmultimedia.com'; $dominio = strstr ($email, '@'); print $dominio; / / imprime @designmultimedia.com

source: See also ereg(), preg_match(), strchr(), stristr(), strpos(), strrchr(), and substr().
es: Vea también stristr(), strrchr(), substr(), y ereg().

source: That is, if you have a string like "This is an example string" you could tokenize this string into its individual words by using the space character as the token.
es: strtok() se usa para dividir en elementos una cadena.

source: $string = "This is\tan example\nstring"; / * Use tab and newline as tokenizing characters as well * / $tok = strtok($string," \n\t"); while ($tok) {echo "Word=$tok br "; $tok = strtok(" \n\t");}
es: Es decir, que si tiene una cadena como "Esta es una cadena de ejemplo" podría dividirla en palabras individuales utilizando el espacio como divisor.

source: Note that only the first call to strtok uses the string argument.
es: Ejemplo 1.

source: Every subsequent call to strtok only needs the token to use, as it keeps track of where it is in the current string.
es: Ejemplo de strtok()

source: Note that you may put multiple tokens in the token parameter.
es: $cadena = "Esta es una cadena de ejemplo"; $tok = strtok ($cadena," "); while ($tok) {echo "Palabra=$tok br "; $tok = strtok (" ");}

source: The behavior when an empty part was found changed with PHP 4.1.0.
es: Nótese que sólo la primera llamada a strtok utiliza el argumento cadena.

source: $first_token = strtok( '/ something',' / '); $second_token = strtok(' / '); var_dump ($first_token, $second_token); / * Output: string(0) "" string(9) "something "* /
es: Para comenzar de nuevo o para dividir otra cadena, simplemente llame a strtok con el argumento de cadena y se inicializará.

source: New strtok() behavior
es: Nótese que puede poner divisores múltiples como parámetro.

source: $first_token = strtok( '/ something',' / '); $second_token = strtok(' / '); var_dump ($first_token, $second_token); / * Output: string(9) "something "bool(false) * /
es: La cadena será dividida cuando alguno de los caracteres del argumento sea hallado.

source: This evaluates to FALSE in conditional expressions.
es: Además tenga cuidado si sus divisores valen "0", pues evalúa como FALSE en las expresiones condicionales.

source: See also split() and explode().
es: Vea también split() y explode().

source: Returns string with all alphabetic characters converted to lowercase.
es: Devuelve la cadena con todas sus letras en minúsculas.
